In [1]:
import pandas as pd
from bs4 import BeautifulSoup
import html5lib
import requests

### In this lab, we will retrieve a list of largest banks by market capitalization.

### The target website is: https://web.archive.org/web/20200318083015/https://en.wikipedia.org/wiki/List_of_largest_banks

#### 1. Using requets to gather the website content:

In [5]:
res = requests.get('https://web.archive.org/web/20200318083015/https://en.wikipedia.org/wiki/List_of_largest_banks')
html_data = res.text

#### 2. Parse the website content by BeautifulSoup:

In [7]:
data = BeautifulSoup(html_data, 'html.parser')

#### 3. Find the "By market capitalization" table and retrieve information from "Bank name" column and "Market cap (US$ billion)" column.

In [13]:
retrieved_data = pd.DataFrame(columns=['Bank Name', 'Market cap (US$ billion)'])

# data has four table, therefore it has four tbody elements.
# "By market capitalization" is the third table.
# So we create a list of tbody elements, and access index [2]

for row in data.find_all('tbody')[2].find_all('tr'):
    col_list = row.find_all('td')
    if len(col_list) > 0:
        bank_name = col_list[1].text.strip()
        market_cap = float(col_list[2].string.strip())
        
        retrieved_data = retrieved_data.append({'Bank Name': bank_name, 'Market cap (US$ billion)': market_cap}, 
                                               ignore_index=True)

In [14]:
retrieved_data

                                  Bank Name  Market cap (US$ billion)
0                            JPMorgan Chase                   390.934
1   Industrial and Commercial Bank of China                   345.214
2                           Bank of America                   325.331
3                               Wells Fargo                   308.013
4                   China Construction Bank                   257.399
..                                      ...                       ...
65                             Ping An Bank                    37.993
66                       Standard Chartered                    37.319
67                     United Overseas Bank                    35.128
68                                QNB Group                    33.560
69                              Bank Rakyat                    33.081

[70 rows x 2 columns]

#### 4. Store retrieved_data in JSON file:

In [15]:
output_path = 'retrieved_data.json'

retrieved_data.to_json(output_path)